wrk/output/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 37.311ms, rate sampling interval: 135ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   836.27ms  771.71ms   1.90s    36.85%
    Req/Sec     9.13k     1.64k   12.15k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  718.85ms
 75.000%    1.80s 
 90.000%    1.83s 
 99.000%    1.88s 
 99.900%    1.90s 
 99.990%    1.90s 
 99.999%    1.90s 
100.000%    1.90s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            1         1.00
       5.407     0.100000        18186         1.11
      25.919     0.200000        36370         1.25
      49.215     0.300000        54555         1.43
     171.007     0.400000        72757         1.67
     718.847     0.500000        90921         2.00
     871.423     0.550000       100027         2.22
    1157.119     0.600000       109097         2.50
    1355.775     0.650000       118324         2.86
    1770.495     0.700000       127486         3.33
    1799.167     0.750000       136381         4.00
    1805.311     0.775000       141866         4.44
    1807.359     0.800000       145826         5.00
    1810.431     0.825000       150466         5.71
    1815.551     0.850000       154927         6.67
    1819.647     0.875000       159504         8.00
    1822.719     0.887500       161672         8.89
    1825.791     0.900000       163840        10.00
    1830.911     0.912500       166579        11.43
    1832.959     0.925000       168761        13.33
    1835.007     0.937500       170795        16.00
    1837.055     0.943750       172321        17.78
    1838.079     0.950000       172974        20.00
    1841.151     0.956250       174031        22.86
    1845.247     0.962500       175028        26.67
    1859.583     0.968750       176144        32.00
    1863.679     0.971875       176754        35.56
    1866.751     0.975000       177332        40.00
    1870.847     0.978125       177972        45.71
    1872.895     0.981250       178644        53.33
    1876.991     0.984375       179114        64.00
    1878.015     0.985938       179303        71.11
    1881.087     0.987500       179627        80.00
    1883.135     0.989062       180003        91.43
    1884.159     0.990625       180155       106.67
    1886.207     0.992188       180446       128.00
    1888.255     0.992969       180678       142.22
    1889.279     0.993750       180892       160.00
    1889.279     0.994531       180892       182.86
    1891.327     0.995313       181069       213.33
    1892.351     0.996094       181269       256.00
    1892.351     0.996484       181269       284.44
    1892.351     0.996875       181269       320.00
    1893.375     0.997266       181425       365.71
    1893.375     0.997656       181425       426.67
    1894.399     0.998047       181590       512.00
    1894.399     0.998242       181590       568.89
    1894.399     0.998437       181590       640.00
    1894.399     0.998633       181590       731.43
    1895.423     0.998828       181730       853.33
    1895.423     0.999023       181730      1024.00
    1895.423     0.999121       181730      1137.78
    1895.423     0.999219       181730      1280.00
    1895.423     0.999316       181730      1462.86
    1895.423     0.999414       181730      1706.67
    1896.447     0.999512       181785      2048.00
    1896.447     0.999561       181785      2275.56
    1896.447     0.999609       181785      2560.00
    1896.447     0.999658       181785      2925.71
    1896.447     0.999707       181785      3413.33
    1896.447     0.999756       181785      4096.00
    1896.447     0.999780       181785      4551.11
    1897.471     0.999805       181824      5120.00
    1897.471     1.000000       181824          inf
#[Mean    =      836.268, StdDeviation   =      771.705]
#[Max     =     1896.448, Total count    =       181824]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  281789 requests in 30.00s, 18.01MB read
Requests/sec:   9393.03
Transfer/sec:    614.58KB