wrk/output/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 2833.344ms, rate sampling interval: 9977ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.22s     3.92s   18.50s    55.36%
    Req/Sec     3.59k   501.00     4.09k    50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.84s 
 75.000%   14.87s 
 90.000%   16.78s 
 99.000%   18.20s 
 99.900%   18.46s 
 99.990%   18.50s 
 99.999%   18.51s 
100.000%   18.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5677.055     0.000000           11         1.00
    6127.615     0.100000         7208         1.11
    7008.255     0.200000        14421         1.25
    8302.591     0.300000        21551         1.43
    9617.407     0.400000        28715         1.67
   10838.015     0.500000        35866         2.00
   11329.535     0.550000        39511         2.22
   12230.655     0.600000        43025         2.50
   12722.175     0.650000        46609         2.86
   13950.975     0.700000        50197         3.33
   14868.479     0.750000        53845         4.00
   15171.583     0.775000        55669         4.44
   15564.799     0.800000        57382         5.00
   16113.663     0.825000        59156         5.71
   16343.039     0.850000        60994         6.67
   16531.455     0.875000        62840         8.00
   16580.607     0.887500        63667         8.89
   16777.215     0.900000        64596        10.00
   17121.279     0.912500        65443        11.43
   17465.343     0.925000        66487        13.33
   17678.335     0.937500        67305        16.00
   17711.103     0.943750        67670        17.78
   17760.255     0.950000        68271        20.00
   17793.023     0.956250        68705        22.86
   17825.791     0.962500        69128        26.67
   17874.943     0.968750        69703        32.00
   17874.943     0.971875        69703        35.56
   17891.327     0.975000        69969        40.00
   17907.711     0.978125        70184        45.71
   17924.095     0.981250        70356        53.33
   17940.479     0.984375        70572        64.00
   18022.399     0.985938        70706        71.11
   18087.935     0.987500        70811        80.00
   18153.471     0.989062        70911        91.43
   18235.391     0.990625        71041       106.67
   18300.927     0.992188        71141       128.00
   18333.695     0.992969        71199       142.22
   18366.463     0.993750        71252       160.00
   18399.231     0.994531        71306       182.86
   18431.999     0.995313        71363       213.33
   18448.383     0.996094        71611       256.00
   18448.383     0.996484        71611       284.44
   18448.383     0.996875        71611       320.00
   18448.383     0.997266        71611       365.71
   18448.383     0.997656        71611       426.67
   18448.383     0.998047        71611       512.00
   18448.383     0.998242        71611       568.89
   18448.383     0.998437        71611       640.00
   18448.383     0.998633        71611       731.43
   18448.383     0.998828        71611       853.33
   18464.767     0.999023        71636      1024.00
   18464.767     0.999121        71636      1137.78
   18464.767     0.999219        71636      1280.00
   18481.151     0.999316        71661      1462.86
   18481.151     0.999414        71661      1706.67
   18481.151     0.999512        71661      2048.00
   18481.151     0.999561        71661      2275.56
   18497.535     0.999609        71685      2560.00
   18497.535     0.999658        71685      2925.71
   18497.535     0.999707        71685      3413.33
   18497.535     0.999756        71685      4096.00
   18497.535     0.999780        71685      4551.11
   18497.535     0.999805        71685      5120.00
   18497.535     0.999829        71685      5851.43
   18497.535     0.999854        71685      6826.67
   18497.535     0.999878        71685      8192.00
   18497.535     0.999890        71685      9102.22
   18497.535     0.999902        71685     10240.00
   18497.535     0.999915        71685     11702.86
   18513.919     0.999927        71691     13653.33
   18513.919     1.000000        71691          inf
#[Mean    =    11221.212, StdDeviation   =     3917.671]
#[Max     =    18497.536, Total count    =        71691]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  114989 requests in 30.00s, 7.35MB read
Requests/sec:   3832.92
Transfer/sec:    250.79KB