wrk/output/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 683.966ms, rate sampling interval: 1950ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.65s   423.75ms   2.27s    59.10%
    Req/Sec     9.36k   348.18     9.68k    90.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.73s 
 75.000%    2.04s 
 90.000%    2.16s 
 99.000%    2.25s 
 99.900%    2.27s 
 99.990%    2.28s 
 99.999%    2.28s 
100.000%    2.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     944.127     0.000000           64         1.00
    1087.487     0.100000        18741         1.11
    1200.127     0.200000        37808         1.25
    1255.423     0.300000        56364         1.43
    1431.551     0.400000        75026         1.67
    1730.559     0.500000        93728         2.00
    1838.079     0.550000       103076         2.22
    1930.239     0.600000       112305         2.50
    1975.295     0.650000       121995         2.86
    2008.063     0.700000       131060         3.33
    2044.927     0.750000       140435         4.00
    2058.239     0.775000       145651         4.44
    2068.479     0.800000       149725         5.00
    2082.815     0.825000       154769         5.71
    2095.103     0.850000       159118         6.67
    2125.823     0.875000       164112         8.00
    2148.351     0.887500       166264         8.89
    2158.591     0.900000       168686        10.00
    2199.551     0.912500       171651        11.43
    2205.695     0.925000       173203        13.33
    2213.887     0.937500       176081        16.00
    2215.935     0.943750       177487        17.78
    2217.983     0.950000       178321        20.00
    2222.079     0.956250       179213        22.86
    2228.223     0.962500       180481        26.67
    2230.271     0.968750       181927        32.00
    2230.271     0.971875       181927        35.56
    2232.319     0.975000       183035        40.00
    2232.319     0.978125       183035        45.71
    2238.463     0.981250       183628        53.33
    2242.559     0.984375       184254        64.00
    2244.607     0.985938       185062        71.11
    2244.607     0.987500       185062        80.00
    2246.655     0.989062       185523        91.43
    2246.655     0.990625       185523       106.67
    2248.703     0.992188       185679       128.00
    2250.751     0.992969       185841       142.22
    2252.799     0.993750       185978       160.00
    2263.039     0.994531       186393       182.86
    2263.039     0.995313       186393       213.33
    2265.087     0.996094       186616       256.00
    2265.087     0.996484       186616       284.44
    2265.087     0.996875       186616       320.00
    2265.087     0.997266       186616       365.71
    2267.135     0.997656       186906       426.67
    2267.135     0.998047       186906       512.00
    2267.135     0.998242       186906       568.89
    2267.135     0.998437       186906       640.00
    2267.135     0.998633       186906       731.43
    2271.231     0.998828       187013       853.33
    2271.231     0.999023       187013      1024.00
    2271.231     0.999121       187013      1137.78
    2271.231     0.999219       187013      1280.00
    2271.231     0.999316       187013      1462.86
    2273.279     0.999414       187067      1706.67
    2273.279     0.999512       187067      2048.00
    2273.279     0.999561       187067      2275.56
    2273.279     0.999609       187067      2560.00
    2273.279     0.999658       187067      2925.71
    2275.327     0.999707       187126      3413.33
    2275.327     1.000000       187126          inf
#[Mean    =     1649.346, StdDeviation   =      423.749]
#[Max     =     2273.280, Total count    =       187126]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  277244 requests in 30.00s, 19.45MB read
Requests/sec:   9241.55
Transfer/sec:    663.90KB